data/cae_te_workspace/experiments/openfoam/mfalign_snappy_v001/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| Moldflow Phase 2: interFoam VOF cavity fill                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.24;

deltaT          1e-05;

adjustTimeStep  yes;

maxCo 1.0;

maxAlphaCo 0.5;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
