data/cae_te_workspace/experiments/openfoam/mfalign_snappy_v001/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
convertToMeters 1;
vertices (
    (-0.05200000074505806 -0.0320000011920929 -0.002) (0.05200000074505806 -0.0320000011920929 -0.002) (0.05200000074505806 0.0320000011920929 -0.002) (-0.05200000074505806 0.0320000011920929 -0.002)
    (-0.05200000074505806 -0.0320000011920929 0.05200000074505806) (0.05200000074505806 -0.0320000011920929 0.05200000074505806) (0.05200000074505806 0.0320000011920929 0.05200000074505806) (-0.05200000074505806 0.0320000011920929 0.05200000074505806)
);
blocks ( hex (0 1 2 3 4 5 6 7) (18 12 12) simpleGrading (1 1 1) );
edges ();
boundary (
    inlet { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    walls { type wall; faces ((0 1 5 4) (3 7 6 2) (0 3 2 1) (4 5 6 7)); }
);
mergePatchPairs ();
