data/cae_te_workspace/experiments/openfoam/mfalign_snappy_v001/system/createPatchDict
FoamFile { version 2.0; format ascii; class dictionary; object createPatchDict; }
pointSync false;
patches
(
    { name gate; patchInfo { type patch; } constructFrom set; set gateFaces; }
    { name vent; patchInfo { type patch; } constructFrom set; set ventFaces; }
);
