data/cae_te_workspace/experiments/openfoam/mfalign_snappy_v001/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
phases          (polymer air);
polymer
{
    transportModel  powerLaw;
    nuMax           [0 2 -1 0 0 0 0] 50;
    nuMin           [0 2 -1 0 0 0 0] 1e-4;
    k               [0 2 -1 0 0 0 0] 0.05;
    n               [0 0 0 0 0 0 0] 0.275;
    rho             [1 -3 0 0 0 0 0] 900;
}
air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.48e-05;
    rho             [1 -3 0 0 0 0 0] 1;
}
sigma           [1 0 -2 0 0 0 0] 0.04;
