data/cae_te_workspace/experiments/openfoam/mfalign_snappy_v001/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    gate     { type fixedValue; value uniform (-6.51 0 0); }
    vent     { type pressureInletOutletVelocity; value uniform (0 0 0); }
    moldflow { type noSlip; }
}
