data/cae_te_workspace/experiments/openfoam/mfalign_snappy_v001/0/p_rgh
FoamFile { version 2.0; format ascii; class volScalarField; object p_rgh; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    gate     { type fixedFluxPressure; value uniform 0; }
    vent     { type totalPressure; p0 uniform 0; value uniform 0; }
    moldflow { type fixedFluxPressure; value uniform 0; }
}
